[
    
    {
    "title": "Guitar",
    "description": "I have been playing the guitar ever since I was 14 years old, and it is one of my greatest passions. I am a die-hard fan of the progressive rock group Dream Theater, and I have meticulously studied their music over the years, particularly their guitar work. I like to think that I'm pretty good at playing the guitar - below are a couple of guitar covers I'm particulary proud of. Of course, there's always room for improvement, and I am always practicing and mixing to get better technique and sound.",
    "imgsrc": ["./jp.jpg"],
    "notes": [{"name": "details coming soon", "description": ""}],
    "ytLinks": ["_cUE6Ya5oXY", "IPGmO2rjrZ0"]
    },
    {
    "title": "Literature",
    "description": "When I was younger, I used to be a voracious reader - now, I still read when I can. I love literature, and perhaps in another life I would have liked to broaden my literary knowledge. Below are some works that have stayed with me over the years...",
    "imgsrc": ["./jp.jpg"],
    "notes": [
        {
        "name": "Dulce et decorum est - Wilfred Owen",
        "description" : "A chilling anti-war poem written by Wilfred Owen, a young British poet who died before the end of WWI. It described graphically the death of one of his comrades brought about by mustard gas."
        },
        {
        "name": "Stoner - John Williams",
        "description" : "A fantastic story, Stoner simply tells the remarkably ordinary story of an ordinary man. It is a celebration of a human life."
        },
        {
        "name": "Catch-22 - Joseph Heller",
        "description" : "What is there to say? Catch-22 is a classic for a reason. It is hilarious..."
        },
        {
        "name": "Tortilla Flat - John Steinbeck",
        "description" : "My grandfather was a well-read man, and Steinbeck was his favourite author. I always remember him when I read Steinbeck. Most of his works are profoundly sad and leave me feeling empty and enriched at the same time..."
        },
        {
        "name": "Ozymandias - Percy Shelley",
        "description" : "Time, the destroyer..."
        }
    ],
    "ytLinks": []
    }

]